In [6]:
%load_ext sql
%sql postgresql://admin:admin@db:5432/company

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Connecting and switching to connection 'postgresql://admin:***@db:5432/company'

In [7]:
%%sql
SELECT * FROM employee;

Running query in 'postgresql://admin:***@db:5432/company'

1 rows affected.

+----+---------------+-----------+-----------------+------------+-----------+
| id |      name     |  position |    department   | hire_date  |   salary  |
+----+---------------+-----------+-----------------+------------+-----------+
| 1  | Himani Gautam | Senior HR | Human Resources | 2025-11-11 | 200000.00 |
+----+---------------+-----------+-----------------+------------+-----------+

In [9]:
%%sql
INSERT INTO employee (name, position, department, hire_date, salary)
VALUES ('Sidhart', 'Database Enginer', 'Software developer', '2025-11-11', 60000.00),
    ('Ankit', 'Backend Enginer', 'Software developer', '2025-11-11', 120000.00);

Running query in 'postgresql://admin:***@db:5432/company'

2 rows affected.

++
||
++
++

In [10]:
%%sql
SELECT * FROM employee;

Running query in 'postgresql://admin:***@db:5432/company'

3 rows affected.

+----+---------------+------------------+--------------------+------------+-----------+
| id |      name     |     position     |     department     | hire_date  |   salary  |
+----+---------------+------------------+--------------------+------------+-----------+
| 1  | Himani Gautam |    Senior HR     |  Human Resources   | 2025-11-11 | 200000.00 |
| 2  |    Sidhart    | Database Enginer | Software developer | 2025-11-11 |  60000.00 |
| 3  |     Ankit     | Backend Enginer  | Software developer | 2025-11-11 | 120000.00 |
+----+---------------+------------------+--------------------+------------+-----------+

In [12]:
%%sql
CREATE TABLE student (
    id INT primary key,
    name VARCHAR(100) not null,
    class VARCHAR(20),
    roll NUMERIC(10)
);

Running query in 'postgresql://admin:***@db:5432/company'

++
||
++
++

In [13]:
%%sql
SELECT * FROM student;

Running query in 'postgresql://admin:***@db:5432/company'

+----+------+-------+------+
| id | name | class | roll |
+----+------+-------+------+
+----+------+-------+------+

In [16]:
%%sql
INSERT INTO student (id, name, class, roll)
VALUES (101, 'Gaurav', 'Post Graduation', 1), 
    (1022, 'Saurav', 'MBBS', 2), 
    (1023, 'Sarita', 'CA', 3);

-- id can't be duplicate

Running query in 'postgresql://admin:***@db:5432/company'

3 rows affected.

++
||
++
++

In [18]:
%%sql
SELECT * FROM student;

Running query in 'postgresql://admin:***@db:5432/company'

3 rows affected.

+------+--------+-----------------+------+
|  id  |  name  |      class      | roll |
+------+--------+-----------------+------+
| 101  | Gaurav | Post Graduation |  1   |
| 1022 | Saurav |       MBBS      |  2   |
| 1023 | Sarita |        CA       |  3   |
+------+--------+-----------------+------+

In [19]:
%%sql
DELETE FROM student WHERE roll = 3

Running query in 'postgresql://admin:***@db:5432/company'

1 rows affected.

++
||
++
++

Above code will delete a perticular **row**

In [20]:
%%sql
SELECT * FROM student;

Running query in 'postgresql://admin:***@db:5432/company'

2 rows affected.

+------+--------+-----------------+------+
|  id  |  name  |      class      | roll |
+------+--------+-----------------+------+
| 101  | Gaurav | Post Graduation |  1   |
| 1022 | Saurav |       MBBS      |  2   |
+------+--------+-----------------+------+

In [ ]:
%%sql
ALTER TABLE student
DROP COLUMN roll;

Above code will delete a perticular **column**

In [22]:
%%sql
SELECT * FROM student;

Running query in 'postgresql://admin:***@db:5432/company'

2 rows affected.

+------+--------+-----------------+
|  id  |  name  |      class      |
+------+--------+-----------------+
| 101  | Gaurav | Post Graduation |
| 1022 | Saurav |       MBBS      |
+------+--------+-----------------+

In [24]:
%%sql
DROP TABLE IF EXISTS student;

Running query in 'postgresql://admin:***@db:5432/company'

++
||
++
++

In [ ]:
%%sql
SELECT * FROM student;

In [ ]:
%%sql
-- DROP DATABASE IF EXISTS company;